app/controllers/images_controller.rb

SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    image = Image.find(params[:id])

INSERT INTO "images" ("caption", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["caption", "hi Chett!"], ["created_at", "2022-01-22 17:02:56.853090"], ["updated_at", "2022-01-22 17:02:56.853090"]]
---
  def create
    # byebug
    image = Image.create(image_params)